MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4800-F100K1536/mcu.h
typedef struct {                                    /*!< (@ 0x48028700) PORT7 Structure                                        */
  __IO uint32_t  OUT;                               /*!< (@ 0x48028700) Port 7 Output Register                                 */
  __O  uint32_t  OMR;                               /*!< (@ 0x48028704) Port 7 Output Modification Register                    */
  __I  uint32_t  RESERVED[2];
  __IO uint32_t  IOCR0;                             /*!< (@ 0x48028710) Port 7 Input/Output Control Register 0                 */
  __IO uint32_t  IOCR4;                             /*!< (@ 0x48028714) Port 7 Input/Output Control Register 4                 */
  __IO uint32_t  IOCR8;                             /*!< (@ 0x48028718) Port 7 Input/Output Control Register 8                 */
  __I  uint32_t  RESERVED1[2];
  __I  uint32_t  IN;                                /*!< (@ 0x48028724) Port 7 Input Register                                  */
  __I  uint32_t  RESERVED2[6];
  __IO uint32_t  PDR0;                              /*!< (@ 0x48028740) Port 7 Pad Driver Mode 0 Register                      */
  __IO uint32_t  PDR1;                              /*!< (@ 0x48028744) Port 7 Pad Driver Mode 1 Register                      */
  __I  uint32_t  RESERVED3[6];
  __I  uint32_t  PDISC;                             /*!< (@ 0x48028760) Port 7 Pin Function Decision Control Register          */
  __I  uint32_t  RESERVED4[3];
  __IO uint32_t  PPS;                               /*!< (@ 0x48028770) Port 7 Pin Power Save Register                         */
  __IO uint32_t  HWSEL;                             /*!< (@ 0x48028774) Port 7 Pin Hardware Select Register                    */
} PORT7_Type;


/* ================================================================================ */
/* ================                      PORT8                     ================ */
/* ================================================================================ */


/**
  * @brief Port 8 (PORT8)
  */

typedef struct {                                    /*!< (@ 0x48028800) PORT8 Structure                                        */
  __IO uint32_t  OUT;                               /*!< (@ 0x48028800) Port 8 Output Register                                 */
  __O  uint32_t  OMR;                               /*!< (@ 0x48028804) Port 8 Output Modification Register                    */
  __I  uint32_t  RESERVED[2];
  __IO uint32_t  IOCR0;                             /*!< (@ 0x48028810) Port 8 Input/Output Control Register 0                 */
  __IO uint32_t  IOCR4;                             /*!< (@ 0x48028814) Port 8 Input/Output Control Register 4                 */
  __IO uint32_t  IOCR8;                             /*!< (@ 0x48028818) Port 8 Input/Output Control Register 8                 */
  __I  uint32_t  RESERVED1[2];
  __I  uint32_t  IN;                                /*!< (@ 0x48028824) Port 8 Input Register                                  */
  __I  uint32_t  RESERVED2[6];
  __IO uint32_t  PDR0;                              /*!< (@ 0x48028840) Port 8 Pad Driver Mode 0 Register                      */
  __IO uint32_t  PDR1;                              /*!< (@ 0x48028844) Port 8 Pad Driver Mode 1 Register                      */
  __I  uint32_t  RESERVED3[6];
  __I  uint32_t  PDISC;                             /*!< (@ 0x48028860) Port 8 Pin Function Decision Control Register          */
  __I  uint32_t  RESERVED4[3];
  __IO uint32_t  PPS;                               /*!< (@ 0x48028870) Port 8 Pin Power Save Register                         */
  __IO uint32_t  HWSEL;                             /*!< (@ 0x48028874) Port 8 Pin Hardware Select Register                    */
} PORT8_Type;


/* ================================================================================ */
/* ================                      PORT9                     ================ */
/* ================================================================================ */


/**
  * @brief Port 9 (PORT9)
  */

typedef struct {                                    /*!< (@ 0x48028900) PORT9 Structure                                        */
  __IO uint32_t  OUT;                               /*!< (@ 0x48028900) Port 9 Output Register                                 */
  __O  uint32_t  OMR;                               /*!< (@ 0x48028904) Port 9 Output Modification Register                    */
  __I  uint32_t  RESERVED[2];
  __IO uint32_t  IOCR0;                             /*!< (@ 0x48028910) Port 9 Input/Output Control Register 0                 */
  __IO uint32_t  IOCR4;                             /*!< (@ 0x48028914) Port 5 Input/Output Control Register 4                 */
  __IO uint32_t  IOCR8;                             /*!< (@ 0x48028918) Port 9 Input/Output Control Register 8                 */
  __I  uint32_t  RESERVED1[2];
  __I  uint32_t  IN;                                /*!< (@ 0x48028924) Port 9 Input Register                                  */
  __I  uint32_t  RESERVED2[6];
  __IO uint32_t  PDR0;                              /*!< (@ 0x48028940) Port 9 Pad Driver Mode 0 Register                      */
  __IO uint32_t  PDR1;                              /*!< (@ 0x48028944) Port 9 Pad Driver Mode 1 Register                      */
  __I  uint32_t  RESERVED3[6];
  __I  uint32_t  PDISC;                             /*!< (@ 0x48028960) Port 9 Pin Function Decision Control Register          */
  __I  uint32_t  RESERVED4[3];
  __IO uint32_t  PPS;                               /*!< (@ 0x48028970) Port 9 Pin Power Save Register                         */
  __IO uint32_t  HWSEL;                             /*!< (@ 0x48028974) Port 9 Pin Hardware Select Register                    */
} PORT9_Type;


/* ================================================================================ */
/* ================                     PORT14                     ================ */
/* ================================================================================ */


/**
  * @brief Port 14 (PORT14)
  */

