MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4800-F100K1536/mcu.h
/* --------------------------------  ECAT_ERR_LED  -------------------------------- */
#define ECAT_ERR_LED_LED_CODE_Pos             (0UL)                     /*!< ECAT ERR_LED: LED_CODE (Bit 0)                              */
#define ECAT_ERR_LED_LED_CODE_Msk             (0xfUL)                   /*!< ECAT ERR_LED: LED_CODE (Bitfield-Mask: 0x0f)                */
#define ECAT_ERR_LED_EN_OVERR_Pos             (4UL)                     /*!< ECAT ERR_LED: EN_OVERR (Bit 4)                              */
#define ECAT_ERR_LED_EN_OVERR_Msk             (0x10UL)                  /*!< ECAT ERR_LED: EN_OVERR (Bitfield-Mask: 0x01)                */

/* ------------------------------  ECAT_PDI_CONTROL  ------------------------------ */
#define ECAT_PDI_CONTROL_PDI_Pos              (0UL)                     /*!< ECAT PDI_CONTROL: PDI (Bit 0)                               */
#define ECAT_PDI_CONTROL_PDI_Msk              (0xffUL)                  /*!< ECAT PDI_CONTROL: PDI (Bitfield-Mask: 0xff)                 */

/* -------------------------------  ECAT_ESC_CONFIG  ------------------------------ */
#define ECAT_ESC_CONFIG_EMUL_Pos              (0UL)                     /*!< ECAT ESC_CONFIG: EMUL (Bit 0)                               */
#define ECAT_ESC_CONFIG_EMUL_Msk              (0x1UL)                   /*!< ECAT ESC_CONFIG: EMUL (Bitfield-Mask: 0x01)                 */
#define ECAT_ESC_CONFIG_EHLD_Pos              (1UL)                     /*!< ECAT ESC_CONFIG: EHLD (Bit 1)                               */
#define ECAT_ESC_CONFIG_EHLD_Msk              (0x2UL)                   /*!< ECAT ESC_CONFIG: EHLD (Bitfield-Mask: 0x01)                 */
#define ECAT_ESC_CONFIG_CLKS_OUT_Pos          (2UL)                     /*!< ECAT ESC_CONFIG: CLKS_OUT (Bit 2)                           */
#define ECAT_ESC_CONFIG_CLKS_OUT_Msk          (0x4UL)                   /*!< ECAT ESC_CONFIG: CLKS_OUT (Bitfield-Mask: 0x01)             */
#define ECAT_ESC_CONFIG_CLKS_IN_Pos           (3UL)                     /*!< ECAT ESC_CONFIG: CLKS_IN (Bit 3)                            */
#define ECAT_ESC_CONFIG_CLKS_IN_Msk           (0x8UL)                   /*!< ECAT ESC_CONFIG: CLKS_IN (Bitfield-Mask: 0x01)              */
#define ECAT_ESC_CONFIG_EHLD_P0_Pos           (4UL)                     /*!< ECAT ESC_CONFIG: EHLD_P0 (Bit 4)                            */
#define ECAT_ESC_CONFIG_EHLD_P0_Msk           (0x10UL)                  /*!< ECAT ESC_CONFIG: EHLD_P0 (Bitfield-Mask: 0x01)              */
#define ECAT_ESC_CONFIG_EHLD_P1_Pos           (5UL)                     /*!< ECAT ESC_CONFIG: EHLD_P1 (Bit 5)                            */
#define ECAT_ESC_CONFIG_EHLD_P1_Msk           (0x20UL)                  /*!< ECAT ESC_CONFIG: EHLD_P1 (Bitfield-Mask: 0x01)              */
#define ECAT_ESC_CONFIG_EHLD_P2_Pos           (6UL)                     /*!< ECAT ESC_CONFIG: EHLD_P2 (Bit 6)                            */
#define ECAT_ESC_CONFIG_EHLD_P2_Msk           (0x40UL)                  /*!< ECAT ESC_CONFIG: EHLD_P2 (Bitfield-Mask: 0x01)              */
#define ECAT_ESC_CONFIG_EHLD_P3_Pos           (7UL)                     /*!< ECAT ESC_CONFIG: EHLD_P3 (Bit 7)                            */
#define ECAT_ESC_CONFIG_EHLD_P3_Msk           (0x80UL)                  /*!< ECAT ESC_CONFIG: EHLD_P3 (Bitfield-Mask: 0x01)              */

/* -------------------------------  ECAT_PDI_CONFIG  ------------------------------ */
#define ECAT_PDI_CONFIG_BUS_CLK_Pos           (0UL)                     /*!< ECAT PDI_CONFIG: BUS_CLK (Bit 0)                            */
#define ECAT_PDI_CONFIG_BUS_CLK_Msk           (0x1fUL)                  /*!< ECAT PDI_CONFIG: BUS_CLK (Bitfield-Mask: 0x1f)              */
#define ECAT_PDI_CONFIG_OC_BUS_Pos            (5UL)                     /*!< ECAT PDI_CONFIG: OC_BUS (Bit 5)                             */
#define ECAT_PDI_CONFIG_OC_BUS_Msk            (0xe0UL)                  /*!< ECAT PDI_CONFIG: OC_BUS (Bitfield-Mask: 0x07)               */

/* ---------------------------  ECAT_SYNC_LATCH_CONFIG  --------------------------- */
#define ECAT_SYNC_LATCH_CONFIG_SYNC0_POL_Pos  (0UL)                     /*!< ECAT SYNC_LATCH_CONFIG: SYNC0_POL (Bit 0)                   */
#define ECAT_SYNC_LATCH_CONFIG_SYNC0_POL_Msk  (0x3UL)                   /*!< ECAT SYNC_LATCH_CONFIG: SYNC0_POL (Bitfield-Mask: 0x03)     */
#define ECAT_SYNC_LATCH_CONFIG_SL0_CNF_Pos    (2UL)                     /*!< ECAT SYNC_LATCH_CONFIG: SL0_CNF (Bit 2)                     */
#define ECAT_SYNC_LATCH_CONFIG_SL0_CNF_Msk    (0x4UL)                   /*!< ECAT SYNC_LATCH_CONFIG: SL0_CNF (Bitfield-Mask: 0x01)       */
#define ECAT_SYNC_LATCH_CONFIG_S0_MAP_Pos     (3UL)                     /*!< ECAT SYNC_LATCH_CONFIG: S0_MAP (Bit 3)                      */
#define ECAT_SYNC_LATCH_CONFIG_S0_MAP_Msk     (0x8UL)                   /*!< ECAT SYNC_LATCH_CONFIG: S0_MAP (Bitfield-Mask: 0x01)        */
#define ECAT_SYNC_LATCH_CONFIG_SYNC1_POL_Pos  (4UL)                     /*!< ECAT SYNC_LATCH_CONFIG: SYNC1_POL (Bit 4)                   */
#define ECAT_SYNC_LATCH_CONFIG_SYNC1_POL_Msk  (0x30UL)                  /*!< ECAT SYNC_LATCH_CONFIG: SYNC1_POL (Bitfield-Mask: 0x03)     */
#define ECAT_SYNC_LATCH_CONFIG_SL1_CNF_Pos    (6UL)                     /*!< ECAT SYNC_LATCH_CONFIG: SL1_CNF (Bit 6)                     */
#define ECAT_SYNC_LATCH_CONFIG_SL1_CNF_Msk    (0x40UL)                  /*!< ECAT SYNC_LATCH_CONFIG: SL1_CNF (Bitfield-Mask: 0x01)       */
#define ECAT_SYNC_LATCH_CONFIG_S1_MAP_Pos     (7UL)                     /*!< ECAT SYNC_LATCH_CONFIG: S1_MAP (Bit 7)                      */
#define ECAT_SYNC_LATCH_CONFIG_S1_MAP_Msk     (0x80UL)                  /*!< ECAT SYNC_LATCH_CONFIG: S1_MAP (Bitfield-Mask: 0x01)        */

/* -----------------------------  ECAT_PDI_EXT_CONFIG  ---------------------------- */
#define ECAT_PDI_EXT_CONFIG_R_Pref_Pos        (0UL)                     /*!< ECAT PDI_EXT_CONFIG: R_Pref (Bit 0)                         */
#define ECAT_PDI_EXT_CONFIG_R_Pref_Msk        (0x3UL)                   /*!< ECAT PDI_EXT_CONFIG: R_Pref (Bitfield-Mask: 0x03)           */
#define ECAT_PDI_EXT_CONFIG_SUB_TYPE_Pos      (8UL)                     /*!< ECAT PDI_EXT_CONFIG: SUB_TYPE (Bit 8)                       */
#define ECAT_PDI_EXT_CONFIG_SUB_TYPE_Msk      (0x700UL)                 /*!< ECAT PDI_EXT_CONFIG: SUB_TYPE (Bitfield-Mask: 0x07)         */

/* -------------------------------  ECAT_EVENT_MASK  ------------------------------ */
#define ECAT_EVENT_MASK_DC_LE_MASK_Pos        (0UL)                     /*!< ECAT EVENT_MASK: DC_LE_MASK (Bit 0)                         */
#define ECAT_EVENT_MASK_DC_LE_MASK_Msk        (0x1UL)                   /*!< ECAT EVENT_MASK: DC_LE_MASK (Bitfield-Mask: 0x01)           */
#define ECAT_EVENT_MASK_DL_SE_MASK_Pos        (2UL)                     /*!< ECAT EVENT_MASK: DL_SE_MASK (Bit 2)                         */
#define ECAT_EVENT_MASK_DL_SE_MASK_Msk        (0x4UL)                   /*!< ECAT EVENT_MASK: DL_SE_MASK (Bitfield-Mask: 0x01)           */
#define ECAT_EVENT_MASK_AL_SE_MASK_Pos        (3UL)                     /*!< ECAT EVENT_MASK: AL_SE_MASK (Bit 3)                         */
#define ECAT_EVENT_MASK_AL_SE_MASK_Msk        (0x8UL)                   /*!< ECAT EVENT_MASK: AL_SE_MASK (Bitfield-Mask: 0x01)           */
#define ECAT_EVENT_MASK_MIR_0_MASK_Pos        (4UL)                     /*!< ECAT EVENT_MASK: MIR_0_MASK (Bit 4)                         */
#define ECAT_EVENT_MASK_MIR_0_MASK_Msk        (0x10UL)                  /*!< ECAT EVENT_MASK: MIR_0_MASK (Bitfield-Mask: 0x01)           */
#define ECAT_EVENT_MASK_MIR_1_MASK_Pos        (5UL)                     /*!< ECAT EVENT_MASK: MIR_1_MASK (Bit 5)                         */
#define ECAT_EVENT_MASK_MIR_1_MASK_Msk        (0x20UL)                  /*!< ECAT EVENT_MASK: MIR_1_MASK (Bitfield-Mask: 0x01)           */
#define ECAT_EVENT_MASK_MIR_2_MASK_Pos        (6UL)                     /*!< ECAT EVENT_MASK: MIR_2_MASK (Bit 6)                         */
#define ECAT_EVENT_MASK_MIR_2_MASK_Msk        (0x40UL)                  /*!< ECAT EVENT_MASK: MIR_2_MASK (Bitfield-Mask: 0x01)           */
#define ECAT_EVENT_MASK_MIR_3_MASK_Pos        (7UL)                     /*!< ECAT EVENT_MASK: MIR_3_MASK (Bit 7)                         */
#define ECAT_EVENT_MASK_MIR_3_MASK_Msk        (0x80UL)                  /*!< ECAT EVENT_MASK: MIR_3_MASK (Bitfield-Mask: 0x01)           */
#define ECAT_EVENT_MASK_MIR_4_MASK_Pos        (8UL)                     /*!< ECAT EVENT_MASK: MIR_4_MASK (Bit 8)                         */
#define ECAT_EVENT_MASK_MIR_4_MASK_Msk        (0x100UL)                 /*!< ECAT EVENT_MASK: MIR_4_MASK (Bitfield-Mask: 0x01)           */
#define ECAT_EVENT_MASK_MIR_5_MASK_Pos        (9UL)                     /*!< ECAT EVENT_MASK: MIR_5_MASK (Bit 9)                         */
#define ECAT_EVENT_MASK_MIR_5_MASK_Msk        (0x200UL)                 /*!< ECAT EVENT_MASK: MIR_5_MASK (Bitfield-Mask: 0x01)           */
#define ECAT_EVENT_MASK_MIR_6_MASK_Pos        (10UL)                    /*!< ECAT EVENT_MASK: MIR_6_MASK (Bit 10)                        */
#define ECAT_EVENT_MASK_MIR_6_MASK_Msk        (0x400UL)                 /*!< ECAT EVENT_MASK: MIR_6_MASK (Bitfield-Mask: 0x01)           */
#define ECAT_EVENT_MASK_MIR_7_MASK_Pos        (11UL)                    /*!< ECAT EVENT_MASK: MIR_7_MASK (Bit 11)                        */
#define ECAT_EVENT_MASK_MIR_7_MASK_Msk        (0x800UL)                 /*!< ECAT EVENT_MASK: MIR_7_MASK (Bitfield-Mask: 0x01)           */

/* -----------------------------  ECAT_AL_EVENT_MASK  ----------------------------- */
#define ECAT_AL_EVENT_MASK_AL_CE_MASK_Pos     (0UL)                     /*!< ECAT AL_EVENT_MASK: AL_CE_MASK (Bit 0)                      */
#define ECAT_AL_EVENT_MASK_AL_CE_MASK_Msk     (0x1UL)                   /*!< ECAT AL_EVENT_MASK: AL_CE_MASK (Bitfield-Mask: 0x01)        */
#define ECAT_AL_EVENT_MASK_DC_LE_MASK_Pos     (1UL)                     /*!< ECAT AL_EVENT_MASK: DC_LE_MASK (Bit 1)                      */
#define ECAT_AL_EVENT_MASK_DC_LE_MASK_Msk     (0x2UL)                   /*!< ECAT AL_EVENT_MASK: DC_LE_MASK (Bitfield-Mask: 0x01)        */
#define ECAT_AL_EVENT_MASK_ST_S0_MASK_Pos     (2UL)                     /*!< ECAT AL_EVENT_MASK: ST_S0_MASK (Bit 2)                      */
#define ECAT_AL_EVENT_MASK_ST_S0_MASK_Msk     (0x4UL)                   /*!< ECAT AL_EVENT_MASK: ST_S0_MASK (Bitfield-Mask: 0x01)        */
#define ECAT_AL_EVENT_MASK_ST_S1_MASK_Pos     (3UL)                     /*!< ECAT AL_EVENT_MASK: ST_S1_MASK (Bit 3)                      */
#define ECAT_AL_EVENT_MASK_ST_S1_MASK_Msk     (0x8UL)                   /*!< ECAT AL_EVENT_MASK: ST_S1_MASK (Bitfield-Mask: 0x01)        */
#define ECAT_AL_EVENT_MASK_SM_A_MASK_Pos      (4UL)                     /*!< ECAT AL_EVENT_MASK: SM_A_MASK (Bit 4)                       */
#define ECAT_AL_EVENT_MASK_SM_A_MASK_Msk      (0x10UL)                  /*!< ECAT AL_EVENT_MASK: SM_A_MASK (Bitfield-Mask: 0x01)         */
#define ECAT_AL_EVENT_MASK_EEP_E_MASK_Pos     (5UL)                     /*!< ECAT AL_EVENT_MASK: EEP_E_MASK (Bit 5)                      */
#define ECAT_AL_EVENT_MASK_EEP_E_MASK_Msk     (0x20UL)                  /*!< ECAT AL_EVENT_MASK: EEP_E_MASK (Bitfield-Mask: 0x01)        */
#define ECAT_AL_EVENT_MASK_WP_D_MASK_Pos      (6UL)                     /*!< ECAT AL_EVENT_MASK: WP_D_MASK (Bit 6)                       */
#define ECAT_AL_EVENT_MASK_WP_D_MASK_Msk      (0x40UL)                  /*!< ECAT AL_EVENT_MASK: WP_D_MASK (Bitfield-Mask: 0x01)         */
#define ECAT_AL_EVENT_MASK_SMI_0_MASK_Pos     (8UL)                     /*!< ECAT AL_EVENT_MASK: SMI_0_MASK (Bit 8)                      */
#define ECAT_AL_EVENT_MASK_SMI_0_MASK_Msk     (0x100UL)                 /*!< ECAT AL_EVENT_MASK: SMI_0_MASK (Bitfield-Mask: 0x01)        */
#define ECAT_AL_EVENT_MASK_SMI_1_MASK_Pos     (9UL)                     /*!< ECAT AL_EVENT_MASK: SMI_1_MASK (Bit 9)                      */
#define ECAT_AL_EVENT_MASK_SMI_1_MASK_Msk     (0x200UL)                 /*!< ECAT AL_EVENT_MASK: SMI_1_MASK (Bitfield-Mask: 0x01)        */
#define ECAT_AL_EVENT_MASK_SMI_2_MASK_Pos     (10UL)                    /*!< ECAT AL_EVENT_MASK: SMI_2_MASK (Bit 10)                     */
#define ECAT_AL_EVENT_MASK_SMI_2_MASK_Msk     (0x400UL)                 /*!< ECAT AL_EVENT_MASK: SMI_2_MASK (Bitfield-Mask: 0x01)        */
#define ECAT_AL_EVENT_MASK_SMI_3_MASK_Pos     (11UL)                    /*!< ECAT AL_EVENT_MASK: SMI_3_MASK (Bit 11)                     */
#define ECAT_AL_EVENT_MASK_SMI_3_MASK_Msk     (0x800UL)                 /*!< ECAT AL_EVENT_MASK: SMI_3_MASK (Bitfield-Mask: 0x01)        */
#define ECAT_AL_EVENT_MASK_SMI_4_MASK_Pos     (12UL)                    /*!< ECAT AL_EVENT_MASK: SMI_4_MASK (Bit 12)                     */
#define ECAT_AL_EVENT_MASK_SMI_4_MASK_Msk     (0x1000UL)                /*!< ECAT AL_EVENT_MASK: SMI_4_MASK (Bitfield-Mask: 0x01)        */
#define ECAT_AL_EVENT_MASK_SMI_5_MASK_Pos     (13UL)                    /*!< ECAT AL_EVENT_MASK: SMI_5_MASK (Bit 13)                     */
#define ECAT_AL_EVENT_MASK_SMI_5_MASK_Msk     (0x2000UL)                /*!< ECAT AL_EVENT_MASK: SMI_5_MASK (Bitfield-Mask: 0x01)        */
#define ECAT_AL_EVENT_MASK_SMI_6_MASK_Pos     (14UL)                    /*!< ECAT AL_EVENT_MASK: SMI_6_MASK (Bit 14)                     */
#define ECAT_AL_EVENT_MASK_SMI_6_MASK_Msk     (0x4000UL)                /*!< ECAT AL_EVENT_MASK: SMI_6_MASK (Bitfield-Mask: 0x01)        */
#define ECAT_AL_EVENT_MASK_SMI_7_MASK_Pos     (15UL)                    /*!< ECAT AL_EVENT_MASK: SMI_7_MASK (Bit 15)                     */
#define ECAT_AL_EVENT_MASK_SMI_7_MASK_Msk     (0x8000UL)                /*!< ECAT AL_EVENT_MASK: SMI_7_MASK (Bitfield-Mask: 0x01)        */
#define ECAT_AL_EVENT_MASK_SMI_8_MASK_Pos     (16UL)                    /*!< ECAT AL_EVENT_MASK: SMI_8_MASK (Bit 16)                     */
#define ECAT_AL_EVENT_MASK_SMI_8_MASK_Msk     (0x10000UL)               /*!< ECAT AL_EVENT_MASK: SMI_8_MASK (Bitfield-Mask: 0x01)        */
#define ECAT_AL_EVENT_MASK_SMI_9_MASK_Pos     (17UL)                    /*!< ECAT AL_EVENT_MASK: SMI_9_MASK (Bit 17)                     */
#define ECAT_AL_EVENT_MASK_SMI_9_MASK_Msk     (0x20000UL)               /*!< ECAT AL_EVENT_MASK: SMI_9_MASK (Bitfield-Mask: 0x01)        */
#define ECAT_AL_EVENT_MASK_SMI_10_MASK_Pos    (18UL)                    /*!< ECAT AL_EVENT_MASK: SMI_10_MASK (Bit 18)                    */
#define ECAT_AL_EVENT_MASK_SMI_10_MASK_Msk    (0x40000UL)               /*!< ECAT AL_EVENT_MASK: SMI_10_MASK (Bitfield-Mask: 0x01)       */
#define ECAT_AL_EVENT_MASK_SMI_11_MASK_Pos    (19UL)                    /*!< ECAT AL_EVENT_MASK: SMI_11_MASK (Bit 19)                    */
#define ECAT_AL_EVENT_MASK_SMI_11_MASK_Msk    (0x80000UL)               /*!< ECAT AL_EVENT_MASK: SMI_11_MASK (Bitfield-Mask: 0x01)       */
#define ECAT_AL_EVENT_MASK_SMI_12_MASK_Pos    (20UL)                    /*!< ECAT AL_EVENT_MASK: SMI_12_MASK (Bit 20)                    */
#define ECAT_AL_EVENT_MASK_SMI_12_MASK_Msk    (0x100000UL)              /*!< ECAT AL_EVENT_MASK: SMI_12_MASK (Bitfield-Mask: 0x01)       */
#define ECAT_AL_EVENT_MASK_SMI_13_MASK_Pos    (21UL)                    /*!< ECAT AL_EVENT_MASK: SMI_13_MASK (Bit 21)                    */
#define ECAT_AL_EVENT_MASK_SMI_13_MASK_Msk    (0x200000UL)              /*!< ECAT AL_EVENT_MASK: SMI_13_MASK (Bitfield-Mask: 0x01)       */
#define ECAT_AL_EVENT_MASK_SMI_14_MASK_Pos    (22UL)                    /*!< ECAT AL_EVENT_MASK: SMI_14_MASK (Bit 22)                    */
#define ECAT_AL_EVENT_MASK_SMI_14_MASK_Msk    (0x400000UL)              /*!< ECAT AL_EVENT_MASK: SMI_14_MASK (Bitfield-Mask: 0x01)       */
#define ECAT_AL_EVENT_MASK_SMI_15_MASK_Pos    (23UL)                    /*!< ECAT AL_EVENT_MASK: SMI_15_MASK (Bit 23)                    */
#define ECAT_AL_EVENT_MASK_SMI_15_MASK_Msk    (0x800000UL)              /*!< ECAT AL_EVENT_MASK: SMI_15_MASK (Bitfield-Mask: 0x01)       */

/* -------------------------------  ECAT_EVENT_REQ  ------------------------------- */
#define ECAT_EVENT_REQ_DC_LE_Pos              (0UL)                     /*!< ECAT EVENT_REQ: DC_LE (Bit 0)                               */
#define ECAT_EVENT_REQ_DC_LE_Msk              (0x1UL)                   /*!< ECAT EVENT_REQ: DC_LE (Bitfield-Mask: 0x01)                 */
#define ECAT_EVENT_REQ_DL_SE_Pos              (2UL)                     /*!< ECAT EVENT_REQ: DL_SE (Bit 2)                               */
#define ECAT_EVENT_REQ_DL_SE_Msk              (0x4UL)                   /*!< ECAT EVENT_REQ: DL_SE (Bitfield-Mask: 0x01)                 */
#define ECAT_EVENT_REQ_AL_SE_Pos              (3UL)                     /*!< ECAT EVENT_REQ: AL_SE (Bit 3)                               */
#define ECAT_EVENT_REQ_AL_SE_Msk              (0x8UL)                   /*!< ECAT EVENT_REQ: AL_SE (Bitfield-Mask: 0x01)                 */
#define ECAT_EVENT_REQ_MIR_0_Pos              (4UL)                     /*!< ECAT EVENT_REQ: MIR_0 (Bit 4)                               */
#define ECAT_EVENT_REQ_MIR_0_Msk              (0x10UL)                  /*!< ECAT EVENT_REQ: MIR_0 (Bitfield-Mask: 0x01)                 */
#define ECAT_EVENT_REQ_MIR_1_Pos              (5UL)                     /*!< ECAT EVENT_REQ: MIR_1 (Bit 5)                               */
#define ECAT_EVENT_REQ_MIR_1_Msk              (0x20UL)                  /*!< ECAT EVENT_REQ: MIR_1 (Bitfield-Mask: 0x01)                 */
#define ECAT_EVENT_REQ_MIR_2_Pos              (6UL)                     /*!< ECAT EVENT_REQ: MIR_2 (Bit 6)                               */
#define ECAT_EVENT_REQ_MIR_2_Msk              (0x40UL)                  /*!< ECAT EVENT_REQ: MIR_2 (Bitfield-Mask: 0x01)                 */
#define ECAT_EVENT_REQ_MIR_3_Pos              (7UL)                     /*!< ECAT EVENT_REQ: MIR_3 (Bit 7)                               */
#define ECAT_EVENT_REQ_MIR_3_Msk              (0x80UL)                  /*!< ECAT EVENT_REQ: MIR_3 (Bitfield-Mask: 0x01)                 */
#define ECAT_EVENT_REQ_MIR_4_Pos              (8UL)                     /*!< ECAT EVENT_REQ: MIR_4 (Bit 8)                               */
#define ECAT_EVENT_REQ_MIR_4_Msk              (0x100UL)                 /*!< ECAT EVENT_REQ: MIR_4 (Bitfield-Mask: 0x01)                 */
#define ECAT_EVENT_REQ_MIR_5_Pos              (9UL)                     /*!< ECAT EVENT_REQ: MIR_5 (Bit 9)                               */
#define ECAT_EVENT_REQ_MIR_5_Msk              (0x200UL)                 /*!< ECAT EVENT_REQ: MIR_5 (Bitfield-Mask: 0x01)                 */
#define ECAT_EVENT_REQ_MIR_6_Pos              (10UL)                    /*!< ECAT EVENT_REQ: MIR_6 (Bit 10)                              */
#define ECAT_EVENT_REQ_MIR_6_Msk              (0x400UL)                 /*!< ECAT EVENT_REQ: MIR_6 (Bitfield-Mask: 0x01)                 */
#define ECAT_EVENT_REQ_MIR_7_Pos              (11UL)                    /*!< ECAT EVENT_REQ: MIR_7 (Bit 11)                              */
#define ECAT_EVENT_REQ_MIR_7_Msk              (0x800UL)                 /*!< ECAT EVENT_REQ: MIR_7 (Bitfield-Mask: 0x01)                 */

