MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4800-F100K1536/mcu.h
/* ----------------------------------  PORT8_OUT  --------------------------------- */
#define PORT8_OUT_P0_Pos                      (0UL)                     /*!< PORT8 OUT: P0 (Bit 0)                                       */
#define PORT8_OUT_P0_Msk                      (0x1UL)                   /*!< PORT8 OUT: P0 (Bitfield-Mask: 0x01)                         */
#define PORT8_OUT_P1_Pos                      (1UL)                     /*!< PORT8 OUT: P1 (Bit 1)                                       */
#define PORT8_OUT_P1_Msk                      (0x2UL)                   /*!< PORT8 OUT: P1 (Bitfield-Mask: 0x01)                         */
#define PORT8_OUT_P2_Pos                      (2UL)                     /*!< PORT8 OUT: P2 (Bit 2)                                       */
#define PORT8_OUT_P2_Msk                      (0x4UL)                   /*!< PORT8 OUT: P2 (Bitfield-Mask: 0x01)                         */
#define PORT8_OUT_P3_Pos                      (3UL)                     /*!< PORT8 OUT: P3 (Bit 3)                                       */
#define PORT8_OUT_P3_Msk                      (0x8UL)                   /*!< PORT8 OUT: P3 (Bitfield-Mask: 0x01)                         */
#define PORT8_OUT_P4_Pos                      (4UL)                     /*!< PORT8 OUT: P4 (Bit 4)                                       */
#define PORT8_OUT_P4_Msk                      (0x10UL)                  /*!< PORT8 OUT: P4 (Bitfield-Mask: 0x01)                         */
#define PORT8_OUT_P5_Pos                      (5UL)                     /*!< PORT8 OUT: P5 (Bit 5)                                       */
#define PORT8_OUT_P5_Msk                      (0x20UL)                  /*!< PORT8 OUT: P5 (Bitfield-Mask: 0x01)                         */
#define PORT8_OUT_P6_Pos                      (6UL)                     /*!< PORT8 OUT: P6 (Bit 6)                                       */
#define PORT8_OUT_P6_Msk                      (0x40UL)                  /*!< PORT8 OUT: P6 (Bitfield-Mask: 0x01)                         */
#define PORT8_OUT_P7_Pos                      (7UL)                     /*!< PORT8 OUT: P7 (Bit 7)                                       */
#define PORT8_OUT_P7_Msk                      (0x80UL)                  /*!< PORT8 OUT: P7 (Bitfield-Mask: 0x01)                         */
#define PORT8_OUT_P8_Pos                      (8UL)                     /*!< PORT8 OUT: P8 (Bit 8)                                       */
#define PORT8_OUT_P8_Msk                      (0x100UL)                 /*!< PORT8 OUT: P8 (Bitfield-Mask: 0x01)                         */
#define PORT8_OUT_P9_Pos                      (9UL)                     /*!< PORT8 OUT: P9 (Bit 9)                                       */
#define PORT8_OUT_P9_Msk                      (0x200UL)                 /*!< PORT8 OUT: P9 (Bitfield-Mask: 0x01)                         */
#define PORT8_OUT_P10_Pos                     (10UL)                    /*!< PORT8 OUT: P10 (Bit 10)                                     */
#define PORT8_OUT_P10_Msk                     (0x400UL)                 /*!< PORT8 OUT: P10 (Bitfield-Mask: 0x01)                        */
#define PORT8_OUT_P11_Pos                     (11UL)                    /*!< PORT8 OUT: P11 (Bit 11)                                     */
#define PORT8_OUT_P11_Msk                     (0x800UL)                 /*!< PORT8 OUT: P11 (Bitfield-Mask: 0x01)                        */
#define PORT8_OUT_P12_Pos                     (12UL)                    /*!< PORT8 OUT: P12 (Bit 12)                                     */
#define PORT8_OUT_P12_Msk                     (0x1000UL)                /*!< PORT8 OUT: P12 (Bitfield-Mask: 0x01)                        */
#define PORT8_OUT_P13_Pos                     (13UL)                    /*!< PORT8 OUT: P13 (Bit 13)                                     */
#define PORT8_OUT_P13_Msk                     (0x2000UL)                /*!< PORT8 OUT: P13 (Bitfield-Mask: 0x01)                        */
#define PORT8_OUT_P14_Pos                     (14UL)                    /*!< PORT8 OUT: P14 (Bit 14)                                     */
#define PORT8_OUT_P14_Msk                     (0x4000UL)                /*!< PORT8 OUT: P14 (Bitfield-Mask: 0x01)                        */
#define PORT8_OUT_P15_Pos                     (15UL)                    /*!< PORT8 OUT: P15 (Bit 15)                                     */
#define PORT8_OUT_P15_Msk                     (0x8000UL)                /*!< PORT8 OUT: P15 (Bitfield-Mask: 0x01)                        */

/* ----------------------------------  PORT8_OMR  --------------------------------- */
#define PORT8_OMR_PS0_Pos                     (0UL)                     /*!< PORT8 OMR: PS0 (Bit 0)                                      */
#define PORT8_OMR_PS0_Msk                     (0x1UL)                   /*!< PORT8 OMR: PS0 (Bitfield-Mask: 0x01)                        */
#define PORT8_OMR_PS1_Pos                     (1UL)                     /*!< PORT8 OMR: PS1 (Bit 1)                                      */
#define PORT8_OMR_PS1_Msk                     (0x2UL)                   /*!< PORT8 OMR: PS1 (Bitfield-Mask: 0x01)                        */
#define PORT8_OMR_PS2_Pos                     (2UL)                     /*!< PORT8 OMR: PS2 (Bit 2)                                      */
#define PORT8_OMR_PS2_Msk                     (0x4UL)                   /*!< PORT8 OMR: PS2 (Bitfield-Mask: 0x01)                        */
#define PORT8_OMR_PS3_Pos                     (3UL)                     /*!< PORT8 OMR: PS3 (Bit 3)                                      */
#define PORT8_OMR_PS3_Msk                     (0x8UL)                   /*!< PORT8 OMR: PS3 (Bitfield-Mask: 0x01)                        */
#define PORT8_OMR_PS4_Pos                     (4UL)                     /*!< PORT8 OMR: PS4 (Bit 4)                                      */
#define PORT8_OMR_PS4_Msk                     (0x10UL)                  /*!< PORT8 OMR: PS4 (Bitfield-Mask: 0x01)                        */
#define PORT8_OMR_PS5_Pos                     (5UL)                     /*!< PORT8 OMR: PS5 (Bit 5)                                      */
#define PORT8_OMR_PS5_Msk                     (0x20UL)                  /*!< PORT8 OMR: PS5 (Bitfield-Mask: 0x01)                        */
#define PORT8_OMR_PS6_Pos                     (6UL)                     /*!< PORT8 OMR: PS6 (Bit 6)                                      */
#define PORT8_OMR_PS6_Msk                     (0x40UL)                  /*!< PORT8 OMR: PS6 (Bitfield-Mask: 0x01)                        */
#define PORT8_OMR_PS7_Pos                     (7UL)                     /*!< PORT8 OMR: PS7 (Bit 7)                                      */
#define PORT8_OMR_PS7_Msk                     (0x80UL)                  /*!< PORT8 OMR: PS7 (Bitfield-Mask: 0x01)                        */
#define PORT8_OMR_PS8_Pos                     (8UL)                     /*!< PORT8 OMR: PS8 (Bit 8)                                      */
#define PORT8_OMR_PS8_Msk                     (0x100UL)                 /*!< PORT8 OMR: PS8 (Bitfield-Mask: 0x01)                        */
#define PORT8_OMR_PS9_Pos                     (9UL)                     /*!< PORT8 OMR: PS9 (Bit 9)                                      */
#define PORT8_OMR_PS9_Msk                     (0x200UL)                 /*!< PORT8 OMR: PS9 (Bitfield-Mask: 0x01)                        */
#define PORT8_OMR_PS10_Pos                    (10UL)                    /*!< PORT8 OMR: PS10 (Bit 10)                                    */
#define PORT8_OMR_PS10_Msk                    (0x400UL)                 /*!< PORT8 OMR: PS10 (Bitfield-Mask: 0x01)                       */
#define PORT8_OMR_PS11_Pos                    (11UL)                    /*!< PORT8 OMR: PS11 (Bit 11)                                    */
#define PORT8_OMR_PS11_Msk                    (0x800UL)                 /*!< PORT8 OMR: PS11 (Bitfield-Mask: 0x01)                       */
#define PORT8_OMR_PS12_Pos                    (12UL)                    /*!< PORT8 OMR: PS12 (Bit 12)                                    */
#define PORT8_OMR_PS12_Msk                    (0x1000UL)                /*!< PORT8 OMR: PS12 (Bitfield-Mask: 0x01)                       */
#define PORT8_OMR_PS13_Pos                    (13UL)                    /*!< PORT8 OMR: PS13 (Bit 13)                                    */
#define PORT8_OMR_PS13_Msk                    (0x2000UL)                /*!< PORT8 OMR: PS13 (Bitfield-Mask: 0x01)                       */
#define PORT8_OMR_PS14_Pos                    (14UL)                    /*!< PORT8 OMR: PS14 (Bit 14)                                    */
#define PORT8_OMR_PS14_Msk                    (0x4000UL)                /*!< PORT8 OMR: PS14 (Bitfield-Mask: 0x01)                       */
#define PORT8_OMR_PS15_Pos                    (15UL)                    /*!< PORT8 OMR: PS15 (Bit 15)                                    */
#define PORT8_OMR_PS15_Msk                    (0x8000UL)                /*!< PORT8 OMR: PS15 (Bitfield-Mask: 0x01)                       */
#define PORT8_OMR_PR0_Pos                     (16UL)                    /*!< PORT8 OMR: PR0 (Bit 16)                                     */
#define PORT8_OMR_PR0_Msk                     (0x10000UL)               /*!< PORT8 OMR: PR0 (Bitfield-Mask: 0x01)                        */
#define PORT8_OMR_PR1_Pos                     (17UL)                    /*!< PORT8 OMR: PR1 (Bit 17)                                     */
#define PORT8_OMR_PR1_Msk                     (0x20000UL)               /*!< PORT8 OMR: PR1 (Bitfield-Mask: 0x01)                        */
#define PORT8_OMR_PR2_Pos                     (18UL)                    /*!< PORT8 OMR: PR2 (Bit 18)                                     */
#define PORT8_OMR_PR2_Msk                     (0x40000UL)               /*!< PORT8 OMR: PR2 (Bitfield-Mask: 0x01)                        */
#define PORT8_OMR_PR3_Pos                     (19UL)                    /*!< PORT8 OMR: PR3 (Bit 19)                                     */
#define PORT8_OMR_PR3_Msk                     (0x80000UL)               /*!< PORT8 OMR: PR3 (Bitfield-Mask: 0x01)                        */
#define PORT8_OMR_PR4_Pos                     (20UL)                    /*!< PORT8 OMR: PR4 (Bit 20)                                     */
#define PORT8_OMR_PR4_Msk                     (0x100000UL)              /*!< PORT8 OMR: PR4 (Bitfield-Mask: 0x01)                        */
#define PORT8_OMR_PR5_Pos                     (21UL)                    /*!< PORT8 OMR: PR5 (Bit 21)                                     */
#define PORT8_OMR_PR5_Msk                     (0x200000UL)              /*!< PORT8 OMR: PR5 (Bitfield-Mask: 0x01)                        */
#define PORT8_OMR_PR6_Pos                     (22UL)                    /*!< PORT8 OMR: PR6 (Bit 22)                                     */
#define PORT8_OMR_PR6_Msk                     (0x400000UL)              /*!< PORT8 OMR: PR6 (Bitfield-Mask: 0x01)                        */
#define PORT8_OMR_PR7_Pos                     (23UL)                    /*!< PORT8 OMR: PR7 (Bit 23)                                     */
#define PORT8_OMR_PR7_Msk                     (0x800000UL)              /*!< PORT8 OMR: PR7 (Bitfield-Mask: 0x01)                        */
#define PORT8_OMR_PR8_Pos                     (24UL)                    /*!< PORT8 OMR: PR8 (Bit 24)                                     */
#define PORT8_OMR_PR8_Msk                     (0x1000000UL)             /*!< PORT8 OMR: PR8 (Bitfield-Mask: 0x01)                        */
#define PORT8_OMR_PR9_Pos                     (25UL)                    /*!< PORT8 OMR: PR9 (Bit 25)                                     */
#define PORT8_OMR_PR9_Msk                     (0x2000000UL)             /*!< PORT8 OMR: PR9 (Bitfield-Mask: 0x01)                        */
#define PORT8_OMR_PR10_Pos                    (26UL)                    /*!< PORT8 OMR: PR10 (Bit 26)                                    */
#define PORT8_OMR_PR10_Msk                    (0x4000000UL)             /*!< PORT8 OMR: PR10 (Bitfield-Mask: 0x01)                       */
#define PORT8_OMR_PR11_Pos                    (27UL)                    /*!< PORT8 OMR: PR11 (Bit 27)                                    */
#define PORT8_OMR_PR11_Msk                    (0x8000000UL)             /*!< PORT8 OMR: PR11 (Bitfield-Mask: 0x01)                       */
#define PORT8_OMR_PR12_Pos                    (28UL)                    /*!< PORT8 OMR: PR12 (Bit 28)                                    */
#define PORT8_OMR_PR12_Msk                    (0x10000000UL)            /*!< PORT8 OMR: PR12 (Bitfield-Mask: 0x01)                       */
#define PORT8_OMR_PR13_Pos                    (29UL)                    /*!< PORT8 OMR: PR13 (Bit 29)                                    */
#define PORT8_OMR_PR13_Msk                    (0x20000000UL)            /*!< PORT8 OMR: PR13 (Bitfield-Mask: 0x01)                       */
#define PORT8_OMR_PR14_Pos                    (30UL)                    /*!< PORT8 OMR: PR14 (Bit 30)                                    */
#define PORT8_OMR_PR14_Msk                    (0x40000000UL)            /*!< PORT8 OMR: PR14 (Bitfield-Mask: 0x01)                       */
#define PORT8_OMR_PR15_Pos                    (31UL)                    /*!< PORT8 OMR: PR15 (Bit 31)                                    */
#define PORT8_OMR_PR15_Msk                    (0x80000000UL)            /*!< PORT8 OMR: PR15 (Bitfield-Mask: 0x01)                       */

/* ---------------------------------  PORT8_IOCR0  -------------------------------- */
#define PORT8_IOCR0_PC0_Pos                   (3UL)                     /*!< PORT8 IOCR0: PC0 (Bit 3)                                    */
#define PORT8_IOCR0_PC0_Msk                   (0xf8UL)                  /*!< PORT8 IOCR0: PC0 (Bitfield-Mask: 0x1f)                      */
#define PORT8_IOCR0_PC1_Pos                   (11UL)                    /*!< PORT8 IOCR0: PC1 (Bit 11)                                   */
#define PORT8_IOCR0_PC1_Msk                   (0xf800UL)                /*!< PORT8 IOCR0: PC1 (Bitfield-Mask: 0x1f)                      */
#define PORT8_IOCR0_PC2_Pos                   (19UL)                    /*!< PORT8 IOCR0: PC2 (Bit 19)                                   */
#define PORT8_IOCR0_PC2_Msk                   (0xf80000UL)              /*!< PORT8 IOCR0: PC2 (Bitfield-Mask: 0x1f)                      */
#define PORT8_IOCR0_PC3_Pos                   (27UL)                    /*!< PORT8 IOCR0: PC3 (Bit 27)                                   */
#define PORT8_IOCR0_PC3_Msk                   (0xf8000000UL)            /*!< PORT8 IOCR0: PC3 (Bitfield-Mask: 0x1f)                      */

/* ---------------------------------  PORT8_IOCR4  -------------------------------- */
#define PORT8_IOCR4_PC4_Pos                   (3UL)                     /*!< PORT8 IOCR4: PC4 (Bit 3)                                    */
#define PORT8_IOCR4_PC4_Msk                   (0xf8UL)                  /*!< PORT8 IOCR4: PC4 (Bitfield-Mask: 0x1f)                      */
#define PORT8_IOCR4_PC5_Pos                   (11UL)                    /*!< PORT8 IOCR4: PC5 (Bit 11)                                   */
#define PORT8_IOCR4_PC5_Msk                   (0xf800UL)                /*!< PORT8 IOCR4: PC5 (Bitfield-Mask: 0x1f)                      */
#define PORT8_IOCR4_PC6_Pos                   (19UL)                    /*!< PORT8 IOCR4: PC6 (Bit 19)                                   */
#define PORT8_IOCR4_PC6_Msk                   (0xf80000UL)              /*!< PORT8 IOCR4: PC6 (Bitfield-Mask: 0x1f)                      */
#define PORT8_IOCR4_PC7_Pos                   (27UL)                    /*!< PORT8 IOCR4: PC7 (Bit 27)                                   */
#define PORT8_IOCR4_PC7_Msk                   (0xf8000000UL)            /*!< PORT8 IOCR4: PC7 (Bitfield-Mask: 0x1f)                      */

